Revit 2026 API

# StructuralSectionGeneralTSlopedWebAngle Property

---

Sloped web angle. (rad)

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SlopedWebAngle { get; set; }
```
```vb
Public Property SlopedWebAngle As Double
	Get
	Set
```
```cpp
public:
property double SlopedWebAngle {
	double get ();
	void set (double value);
}
```
```fsharp
member SlopedWebAngle : float with get, set
```

#### Property Value

Double

#### Reference

StructuralSectionGeneralT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace